#include "Draw.h"
#include "ADDR.h"
ADDR client;
Draw draw;

void start();

int main(int argc, char* argv[]) {
	setlocale(LC_ALL, "ru");
	while(client.connection()){}

	start();
	draw.setup();

	while (1) {
		draw.draw();
		//input();
		//logic();
		Sleep(1000);
	}

	//draw();
	//input();
	//logic();

	system("pause");
	return 0;
}

void start() {
	int n;
	cout << "Приветсвую в игре Вирусы\nПравила игры:\n1. Для выбора клетки от которой будет произведен ход, необходимо ввести ее координаты"
		". Затем выбрать клетку, в которой поставить новый вирус.\n2. Вирусы ставятся только в ближайшей клетке (по вертикали и по горизонтали)"
		", по диагоняли клетки занимать НЕЛЬЗЯ.\n3. Ходы идут поочердно, игра происходит против ИИ,"
		"в роли которой выступает сервер, к которому произошло подключение.\n4. Побеждает тот, кто захватит все поле,"
		" в случае невозможности это сделать, объявляется ничья\n------\nУдачи, игрок!!!\n";
	system("pause");
	cout << "\nДля выбора размерности поля NxN, введите число (больше 3-х и менее 16-и):\n";
	while (1) {
		cin >> n;
		if (n > 3 && n <16)
			break;
		else
			cout << "Некорректный ввод, введите снова!!!\n";
	}
	draw.setN(n);
	client.sendingint(n);
}
